Import the dependent libraries

In [127]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

Magic line so we don't have to put plt.show every time

In [128]:
%matplotlib inline

read the GDP file without the footnotes

In [129]:
gdp_df = pd.read_csv("../data/gdp_percapita.csv", nrows=6868)

gdp tail view

In [130]:
gdp_df.tail(6)

     Country or Area  Year        Value  Value Footnotes
6862        Zimbabwe  1995  3226.413930              NaN
6863        Zimbabwe  1994  3263.934978              NaN
6864        Zimbabwe  1993  3033.504852              NaN
6865        Zimbabwe  1992  3054.889178              NaN
6866        Zimbabwe  1991  3426.598094              NaN
6867        Zimbabwe  1990  3324.348171              NaN

read the internet use file without the footnotes

In [131]:
internet_df = pd.read_csv("../data/internet_use.csv", nrows=4495, skip_blank_lines=True)

internet use tail view

In [132]:
internet_df.tail(6)

     Country or Area  Year     Value  Value Footnotes
4489        Zimbabwe  1998  0.081648              NaN
4490        Zimbabwe  1997  0.033080              NaN
4491        Zimbabwe  1996  0.016790              NaN
4492        Zimbabwe  1995  0.007684              NaN
4493        Zimbabwe  1994  0.001739              NaN
4494        Zimbabwe  1990  0.000000              NaN

Look at the shape of each DataFrame - how many rows? How many columns?

In [133]:
gdp_df.shape

(6868, 4)

In [134]:
internet_df.shape

(4495, 4)

Take a look at the datatypes for the columns in each DataFrame.

In [135]:
type(gdp_df)

pandas.core.frame.DataFrame

In [136]:
type(internet_df)

pandas.core.frame.DataFrame

Take a look at the last 10 rows of each DataFrame in turn.

In [137]:
gdp_df.tail(10)

     Country or Area  Year        Value  Value Footnotes
6858        Zimbabwe  1999  3600.849291              NaN
6859        Zimbabwe  1998  3653.920016              NaN
6860        Zimbabwe  1997  3580.048793              NaN
6861        Zimbabwe  1996  3520.430146              NaN
6862        Zimbabwe  1995  3226.413930              NaN
6863        Zimbabwe  1994  3263.934978              NaN
6864        Zimbabwe  1993  3033.504852              NaN
6865        Zimbabwe  1992  3054.889178              NaN
6866        Zimbabwe  1991  3426.598094              NaN
6867        Zimbabwe  1990  3324.348171              NaN

In [138]:
internet_df.tail(10)

     Country or Area  Year     Value  Value Footnotes
4485        Zimbabwe  2002  3.994356              NaN
4486        Zimbabwe  2001  0.799846              NaN
4487        Zimbabwe  2000  0.401434              NaN
4488        Zimbabwe  1999  0.161676              NaN
4489        Zimbabwe  1998  0.081648              NaN
4490        Zimbabwe  1997  0.033080              NaN
4491        Zimbabwe  1996  0.016790              NaN
4492        Zimbabwe  1995  0.007684              NaN
4493        Zimbabwe  1994  0.001739              NaN
4494        Zimbabwe  1990  0.000000              NaN

Drop the value footnotes column from both DataFrames. Check that this worked as expected.

In [139]:
gdp_df = gdp_df.drop("Value Footnotes", axis=1)
internet_df = internet_df.drop("Value Footnotes", axis=1)

Change the columns for the GDP Per Capita DataFrame to ‘Country’, ‘Year’, and ‘GDP_Per_Capita’.

In [140]:
gdp_df = gdp_df.rename(columns={"Country or Area": "Country", "Year": "Year", "Value":"GDP_Per_Capita"})

Change the columns for the Internet Users DataFrame to ‘Country’, ‘Year’, and ‘Internet_Users_Pct’.

In [141]:
internet_df = internet_df.rename(columns={"Country or Area": "Country", "Year": "Year", "Value":"Internet_Users_Pct"})

Merge the two DataFrames to one. Merge all rows from each of the two DataFrames. Call the new DataFrame gdp_and_internet_use.

In [142]:
gdp_and_internet_use = pd.merge(gdp_df, internet_df, how="outer", on=["Country","Year"])

Look at the first five rows of your new DataFrame to confirm it merged correctly.

In [143]:
gdp_and_internet_use.head(5)

       Country  Year  GDP_Per_Capita  Internet_Users_Pct
0  Afghanistan  2019     2065.036398                 NaN
1  Afghanistan  2018     2033.779002                 NaN
2  Afghanistan  2017     2058.383832                 NaN
3  Afghanistan  2016     2057.062164                 NaN
4  Afghanistan  2015     2068.265904                 NaN

Look at the last five rows to make sure the data is clean and as expected.

In [144]:
gdp_and_internet_use.tail(5)

     Country  Year  GDP_Per_Capita  Internet_Users_Pct
7900   Yemen  1999             NaN            0.056629
7901   Yemen  1998             NaN            0.023323
7902   Yemen  1997             NaN            0.015025
7903   Yemen  1996             NaN            0.000621
7904   Yemen  1990             NaN            0.000000

Subset the combined DataFrame to keep only the data for 2004, 2009, and 2014. Check that this happened correctly.

In [145]:
only_years = [2004, 2009, 2014]
filter_3_years = gdp_and_internet_use[gdp_and_internet_use["Year"].isin(only_years)]
filter_3_years

                    Country  Year  GDP_Per_Capita  Internet_Users_Pct
5               Afghanistan  2014     2102.385234            6.390000
10              Afghanistan  2009     1758.904043            3.550000
15              Afghanistan  2004     1200.278256            0.105809
23                  Albania  2014    11623.866679           60.100000
28                  Albania  2009    10346.864199           41.200000
...                     ...   ...             ...                 ...
7868  Virgin Islands (U.S.)  2009             NaN           27.396510
7873  Virgin Islands (U.S.)  2004             NaN           27.377009
7885                  Yemen  2014             NaN           22.550000
7890                  Yemen  2009             NaN            9.960000
7895                  Yemen  2004             NaN            0.881223

[830 rows x 4 columns]

Create three new DataFrames, one for 2004, one for 2009, and one for 2014. Give them meaningful names that aren't too long.

In [146]:
oh_four = filter_3_years[filter_3_years["Year"]==2004]
oh_nine = filter_3_years[filter_3_years["Year"]==2009]
fourteen = filter_3_years[filter_3_years["Year"]==2014]
oh_four
oh_nine
fourteen

                    Country  Year  GDP_Per_Capita  Internet_Users_Pct
5               Afghanistan  2014     2102.385234                6.39
23                  Albania  2014    11623.866679               60.10
53                  Algeria  2014    11512.705405               18.09
83                   Angola  2014     8239.828837               21.26
113     Antigua and Barbuda  2014    18104.241470               64.00
...                     ...   ...             ...                 ...
7761     T.F.Y.R. Macedonia  2014             NaN               68.06
7819              Venezuela  2014             NaN               57.00
7843               Viet Nam  2014             NaN               48.31
7863  Virgin Islands (U.S.)  2014             NaN               50.07
7885                  Yemen  2014             NaN               22.55

[277 rows x 4 columns]

Which country had the highest percentage of internet users in 2014? What was the percentage? (Try typing the first 3 letters of your DataFrame name and hitting the tab key for auto-complete options).

In [148]:
max14 = fourteen.loc[fourteen.groupby('Year')['Internet_Users_Pct'].idxmax()]
print(max14)

      Country  Year  GDP_Per_Capita  Internet_Users_Pct
2625  Iceland  2014      49652.1495               98.16

Which country had the lowest percentage of internet users in 2014? What was the percentage?

In [149]:
min14 = fourteen.loc[fourteen.groupby('Year')['Internet_Users_Pct'].idxmin()]
print(min14)

                          Country  Year  GDP_Per_Capita  Internet_Users_Pct
7079  Dem. People's Rep. of Korea  2014             NaN                 0.0

Repeat for 2004 and 2009.

In [151]:
print("----------2004 Max and Min:")
max04 = oh_four.loc[oh_four.groupby('Year')['Internet_Users_Pct'].idxmax()]
print(max04)
min04 = oh_four.loc[oh_four.groupby('Year')['Internet_Users_Pct'].idxmin()]
print(min04)
print("----------2009 Max and Min:")
max09 = oh_nine.loc[oh_nine.groupby('Year')['Internet_Users_Pct'].idxmax()]
print(max09)
min09 = oh_nine.loc[oh_nine.groupby('Year')['Internet_Users_Pct'].idxmin()]
print(min09)

----------2004 Max and Min:
     Country  Year  GDP_Per_Capita  Internet_Users_Pct
6019  Sweden  2004    44496.023401               83.89
                          Country  Year  GDP_Per_Capita  Internet_Users_Pct
7088  Dem. People's Rep. of Korea  2004             NaN                 0.0
----------2009 Max and Min:
      Country  Year  GDP_Per_Capita  Internet_Users_Pct
2630  Iceland  2009    48177.084123                93.0
                          Country  Year  GDP_Per_Capita  Internet_Users_Pct
7083  Dem. People's Rep. of Korea  2009             NaN                 0.0

Which country had the highest gdp per capita in 2014? What was the gdp per capita?

In [152]:
gdp_max04 = oh_four.loc[oh_four.groupby('Year')['GDP_Per_Capita'].idxmax()]
print(max09)
gdp_max09 = oh_nine.loc[oh_nine.groupby('Year')['GDP_Per_Capita'].idxmax()]
print(max09)
gdp_max14 = fourteen.loc[fourteen.groupby('Year')['GDP_Per_Capita'].idxmax()]
print(max14)

      Country  Year  GDP_Per_Capita  Internet_Users_Pct
2630  Iceland  2009    48177.084123                93.0
      Country  Year  GDP_Per_Capita  Internet_Users_Pct
2630  Iceland  2009    48177.084123                93.0
      Country  Year  GDP_Per_Capita  Internet_Users_Pct
2625  Iceland  2014      49652.1495               98.16

Which country had the lowest gdp per capita in 2014? What was the gdp per capita?

In [153]:
gdp_min04 = oh_four.loc[oh_four.groupby('Year')['GDP_Per_Capita'].idxmin()]
print(min09)
gdp_min09 = oh_nine.loc[oh_nine.groupby('Year')['GDP_Per_Capita'].idxmin()]
print(min09)
gdp_min14 = fourteen.loc[fourteen.groupby('Year')['GDP_Per_Capita'].idxmin()]
print(min14)

                          Country  Year  GDP_Per_Capita  Internet_Users_Pct
7083  Dem. People's Rep. of Korea  2009             NaN                 0.0
                          Country  Year  GDP_Per_Capita  Internet_Users_Pct
7083  Dem. People's Rep. of Korea  2009             NaN                 0.0
                          Country  Year  GDP_Per_Capita  Internet_Users_Pct
7079  Dem. People's Rep. of Korea  2014             NaN                 0.0

Create some scatterplots:
a. 2004 Percent Using the Internet vs GDP Per Capita
b. 2009 Percent Using the Internet vs GDP Per Capita
c. 2014 Percent Using the Internet vs GDP Per Capita

Are there differences across years? What do the plots tell you about any relationship between these two variables? Enter your observations as a markdown cell.

Look at the distribution of gdp per capita values for 2014. Is it unimodal?

Look at the distribution of Internet Use for 2014. Is it unimodal?

What are the top 5 countries in terms of internet use in 2014?

Create a DataFrame called top_5_internet from the combined DataFrame that has all three years for the 5 countries that had the greatest 2014 internet usage. You should have 15 rows. Check that this is true.

Create a seaborn FacetGrid to show the internet usage trend across the years 2004, 2009, and 2014 for these 5 countries (those with the highest reported internet use in 2014). Which country had the greatest growth between 2004 and 2014?

Repeat the steps above to look at the trend for the 5 countries with the lowest 2014 internet usage. Which country has consistently had the least internet use?

Find the top 5 countries for 2014 in terms of GDP per capita; create a DataFrame to look at 10-year trends (use 2004, 2009, 2014 to look at the 10-year trend) in gdp per capita for the 5 countries with the highest 2014 GDP per capita. Use a seaborn facet grid for this.

Repeat this one more time to look at 10-year trend for the 5 countries for 2014 with the lowest GDP per capita.

Is there anything surprising or unusual in any of these plots? Searching on the internet, can you find any possible explanations for unusual findings?

BONUS: Download another data set from the UN data (http://data.un.org/Explorer.aspx) to merge with your data and explore.